-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/stevenchung/Desktop/Project/EdwardSen_StevenChung_Log.log
  log type:  text
 opened on:  29 Nov 2023, 16:26:08

. 
. // i. Data cleaning
. clear

. ssc install xtoverid
checking xtoverid consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install ivreg2
checking ivreg2 consistency and verifying not already installed...
all files already exist and are up to date.

. ssc install estout
checking estout consistency and verifying not already installed...
all files already exist and are up to date.

. net install gr0002.pkg, from(http://www.stata-journal.com/software/sj3-3/)
checking gr0002 consistency and verifying not already installed...
all files already exist and are up to date.

. eststo clear

. cd "C:\Users\admin\Desktop\ECO375\Project"
unable to change to C:\Users\admin\Desktop\ECO375\Project
r(170);

end of do-file

r(170);

. exit
